{
  "</answer>": 151691,
  "</audio>": 151707,
  "</body>": 151681,
  "</gen_audio>": 151710,
  "</gen_image>": 151701,
  "</html>": 151679,
  "</image>": 151696,
  "</prompt>": 151672,
  "</table>": 151683,
  "</td>": 151687,
  "</think>": 151689,
  "</thinker_prefix>": 151674,
  "</tool_call>": 151658,
  "</tr>": 151685,
  "</video>": 151698,
  "</vp>": 151676,
  "<answer>": 151690,
  "<asr>": 151714,
  "<audio>": 151706,
  "<audioHere>": 151711,
  "<audioPatch>": 151705,
  "<audio_bos>": 151665,
  "<audio_eos>": 151666,
  "<audio_pad>": 151667,
  "<body>": 151680,
  "<end_of_audio>": 151704,
  "<end_of_chunk>": 151703,
  "<framePatch>": 151712,
  "<gen_audio>": 151709,
  "<gen_audioPatch>": 151708,
  "<gen_image>": 151700,
  "<gen_imagePatch>": 151699,
  "<html>": 151678,
  "<image>": 151695,
  "<imageHere>": 151702,
  "<imagePatch>": 151694,
  "<prompt>": 151671,
  "<table>": 151682,
  "<td>": 151686,
  "<text>": 151713,
  "<text_bos>": 151668,
  "<text_eos>": 151669,
  "<text_pad>": 151670,
  "<think>": 151688,
  "<thinker_prefix>": 151673,
  "<tool_call>": 151657,
  "<tr>": 151684,
  "<tts>": 151715,
  "<video>": 151697,
  "<vp>": 151675,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|startoftext|>": 151692,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652,
  "[gMASK]": 151693,
  "[item]": 151677
}
