{
  "additional_special_tokens": [
    "[item]",
    "<html>",
    "</html>",
    "<body>",
    "</body>",
    "<table>",
    "</table>",
    "<tr>",
    "</tr>",
    "<td>",
    "</td>",
    "<think>",
    "</think>",
    "<answer>",
    "</answer>",
    "<|startoftext|>",
    "[gMASK]"
  ],
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
